app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テスト"], ["body", "投稿テスト２"], ["created_at", "2020-03-08 05:37:57.455827"], ["updated_at", "2020-03-08 05:37:57.455827"]]
---
  def create
        list = List.new(list_params)
        list.save

SELECT "lists".* FROM "lists"
---
    def index
    	@lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    	@list = List.find(params[:id])